//index.js
//获取应用实例
const app = getApp()

Page({
  data: {
    play: true,
    dots: true,
    timeall: 5000,
    time: 2000,
    imgurl: [
      "/image/lunbo2.jpg",
      "/image/lunbo4.jpg",
      "/image/lunbo6.jpg",
    ],
    piclist: [
      { src: 'image/book1.jpg' },
      { src: 'image/book1.jpg' },
      { src: 'image/book1.jpg' },
      { src: 'image/book1.jpg' }
    ],
    list: [
      {
        src: '/image/pic1.jpg',
        title: "赠吴秀林东归 [宋]林景熙",
        desc: "几夜高堂梦，不知山水长。\n西风归雁荡，落日过乌伤。\n断影云空白，孤心草欲黄。终邻负甘旨，泪洒蓼莪章。",  
        translator:"作者：林景熙（1242～1310），字德暘，一作德阳，号霁山。温州平阳（今属浙江）人。南宋末期爱国诗人。咸淳七年（公元1271年），由上舍生释褐成进士，历任泉州教授，礼部架阁，进阶从政郎。宋亡后不仕，隐居于平阳县城白石巷。林景熙等曾冒死捡拾帝骨葬于兰亭附近。他教授生徒，从事著作，漫游江浙，是雄踞宋元之际诗坛、创作成绩卓著、最富代表性的作家，也是温州历史上成就最高的诗人。卒葬家乡青芝山。"
      },
      {
        src: '/image/pic3.jpg',
        title: "鼓吹曲辞 [唐]李白",
        desc: "我思仙人，乃在碧海之东隅。\n海寒多天风，白波连山倒蓬壶。\n长鲸喷涌不可涉，抚心茫茫泪如珠。\n西来青鸟东飞去，愿寄一书谢麻姑。",
        translator:"赏析：此诗为拟古之作。诗以六朝古都金陵为背景，表现君臣威仪，歌舞升平。实为歌功颂德之作，其中无真情实感。首二句写金陵形胜。“铙歌”以下四句写宫廷乐队导引大臣上朝。乐队乘骑，列队奏乐，引导纷至沓来的众公卿入朝；钟声报时，提示官员按时着装，准备朝见皇帝。随着鼓声，一道道城门大开，公卿们一个个雁行而进。“天子”四句写皇帝接见公卿的盛况。皇帝凭几而坐，公卿们纷纷上殿，多如行云。阳光普照下，公卿们的黼黻冠冕灿若明星。日喻君，星喻臣。末二句写公卿们罢朝后的悠闲生活。沐浴罢，或游览名胜，或聚集宫门，尽情欢愉，充分享受着皇帝赐予的恩宠。"
      },

      {
        src: '/image/pic2.jpg',
        title: "越人歌 佚名",
        desc: "今夕何夕兮，搴舟中流。\n今日何日兮，得与王子同舟。\n蒙羞被好兮，不訾诟耻。\n心几烦而不绝兮，得知王子。\n山有木兮木有枝，心悦君兮君不知。",
        translator:"历史典故：相传楚国鄂君子哲初来到所受的封地时，举行了盛大的舟游盛宴，越人则在这场盛大的舟游中认识新来的领主并以可以为之效劳为荣，其中一个越人对鄂君拥楫而歌，鄂君不懂得越语，于是便着人翻译，如此得来了一首《越人歌》。鄂君被这真诚的歌声所感动，按照楚人的礼节，双手扶了扶越人的双肩，又庄重地把一幅绣满美丽花纹的绸缎被面披在他身上。如此看来，这首越人歌的创作背景表现的越人忠诚和拥护。"
      },
      {
        src: '/image/pic1.jpg',
        title: "涉江采芙蓉 两汉：佚名",
        desc: "涉江采芙蓉，兰泽多芳草。\n采之欲遗谁，所思在远道。\n还顾望旧乡，长路漫浩浩。\n同心而离居，忧伤以终老。",
        translator: "翻译：我踏过江水去采荷花，生有兰草的水泽中长满了香草。可是我采了荷花要送给谁呢？我想要送给远方的爱人。回头看那一起生活过的故乡，长路漫漫遥望无边无际。两心相爱却要分隔两地不能在一起，愁苦忧伤以至终老异乡。"
      },
      
    ]

  },
  //页面加载事件
  onLoad: function () {
  },
  
  detail: function (e) {
    //  e.currentTarget获得当前事件的标签
    //dataset获得 以data开头的属性
    var i = e.currentTarget.dataset.aa;
    wx.navigateTo({
      url: '/pages/comment/comment',
    })
  },
  onTapDayWeather() {
    wx.navigateTo({
      url: '/pages/list/list',
    })
  }



})